# YOLOv8s model with Mish activation function

# Parameters
nc: 4                # IMPORTANT: Change to 4 for your road damage dataset
depth_multiple: 0.33  # Standard for YOLOv8s
width_multiple: 0.50  # Standard for YOLOv8s

# This key tells the Ultralytics parser to override the default activation (SiLU)
# with the 'Mish' class we will register from our training script.
activation: Mish

# YOLOv8.0s backbone (using STANDARD module names)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

# YOLOv8.0s head (using STANDARD module names)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512, False]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256, False]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512, False]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024, False]]
  - [[15, 18, 21], 1, Detect, [nc]]
