# YOLOv8s model configuration with EinsteinActivationFunction and SEBlock

# Parameters
nc: 4  # number of classes
activation: 'EinsteinActivationFunction()'  # default activation

# YOLOv8s backbone with SEBlock
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                     # 0
  - [-1, 1, Conv, [128, 3, 2]]                    # 1
  - [-1, 3, C2f, [128, True]]                     # 2
  - [-1, 1, SEBlock, [128]]                       # 3
  - [-1, 1, Conv, [256, 3, 2]]                    # 4
  - [-1, 6, C2f, [256, True]]                     # 5
  - [-1, 1, SEBlock, [256]]                       # 6
  - [-1, 1, Conv, [512, 3, 2]]                    # 7
  - [-1, 6, C2f, [512, True]]                     # 8
  - [-1, 1, SEBlock, [512]]                       # 9
  - [-1, 1, Conv, [1024, 3, 2]]                   # 10
  - [-1, 3, C2f, [1024, True]]                    # 11
  - [-1, 1, SEBlock, [1024]]                      # 12
  - [-1, 1, SPPF, [1024, 5]]                      # 13

# YOLOv8s head
head:
  - [-1, 1, Conv, [512, 1, 1]]                    # 14
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 15
  - [[-1, 9], 1, Concat, [1]]                     # 16
  - [-1, 3, C2f, [512]]                           # 17
  - [-1, 1, Conv, [256, 1, 1]]                    # 18
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 19
  - [[-1, 6], 1, Concat, [1]]                     # 20
  - [-1, 3, C2f, [256]]                           # 21
  - [-1, 1, Conv, [256, 3, 2]]                    # 22
  - [[-1, 17], 1, Concat, [1]]                    # 23
  - [-1, 3, C2f, [512]]                           # 24
  - [-1, 1, Conv, [512, 3, 2]]                    # 25
  - [[-1, 13], 1, Concat, [1]]                    # 26
  - [-1, 3, C2f, [1024]]                          # 27
  - [[14, 24, 27], 1, Detect, [nc]]               # 28

