# YOLOv8s model with Swish activation (for CRDDC2022 subset)

# Number of classes
nc: 4  # ['D00', 'D10', 'D20', 'D40']

# Depth and width multipliers
depth_multiple: 0.33
width_multiple: 0.50

# Import custom modules
custom_imports:
  - from: custom_explicit_swish_modules
    imports:
      - ConvExplicitSwish
      - C2fExplicitSwish

# YOLOv8s backbone using Swish
backbone:
  [[-1, 1, ConvExplicitSwish, [64, 3, 2]],           # 0-P1/2
   [-1, 1, ConvExplicitSwish, [128, 3, 2]],          # 1-P2/4
   [-1, 3, C2fExplicitSwish, [128, True]],           # 2
   [-1, 1, ConvExplicitSwish, [256, 3, 2]],          # 3-P3/8
   [-1, 6, C2fExplicitSwish, [256, True]],           # 4
   [-1, 1, ConvExplicitSwish, [512, 3, 2]],          # 5-P4/16
   [-1, 6, C2fExplicitSwish, [512, True]],           # 6
   [-1, 1, ConvExplicitSwish, [1024, 3, 2]],         # 7-P5/32
   [-1, 3, C2fExplicitSwish, [1024, True]],          # 8
   [-1, 1, SPPF, [1024, 5]],                         # 9
  ]

# YOLOv8s head using Swish
head:
  [[-1, 1, ConvExplicitSwish, [512, 1, 1]],          # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],       # 11
   [[-1, 6], 1, Concat, [1]],                        # 12
   [-1, 3, C2fExplicitSwish, [512]],                 # 13

   [-1, 1, ConvExplicitSwish, [256, 1, 1]],          # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],       # 15
   [[-1, 4], 1, Concat, [1]],                        # 16
   [-1, 3, C2fExplicitSwish, [256]],                 # 17

   [-1, 1, ConvExplicitSwish, [256, 3, 2]],          # 18
   [[-1, 14], 1, Concat, [1]],                       # 19
   [-1, 3, C2fExplicitSwish, [512]],                 # 20

   [-1, 1, ConvExplicitSwish, [512, 3, 2]],          # 21
   [[-1, 10], 1, Concat, [1]],                       # 22
   [-1, 3, C2fExplicitSwish, [1024]],                # 23

   [[17, 20, 23], 1, Detect, [nc]],                  # 24 Detect(P3, P4, P5)
  ]

